[{
  "_id": {
    "$oid": "6412904f4c3e0a23f5491a5e"
  },
  "title": "Test Movie",
  "description": "Test Movie",
  "duration": 12,
  "genre": "test",
  "imageName": "0c577120-33df-4ba5-9dfe-d55715c52363-interstellar.jpg"
},{
  "_id": {
    "$oid": "64153debb32d5861b122efe3"
  },
  "title": "65",
  "description": "After a catastrophic crash on an unknown planet, pilot Mills (Adam Driver) quickly discovers he’s actually stranded on Earth…65 million years ago. Now, with only one chance at rescue, Mills and the only other survivor, Koa (Ariana Greenblatt), must make their way across an unknown terrain riddled with dangerous prehistoric creatures in an epic fight to survive. ",
  "duration": 93,
  "genre": "Science Fiction, Thriller, Action",
  "imageName": "14661974-7286-4c59-b4a9-c81aebc2c091-65.jpg"
},{
  "_id": {
    "$oid": "64153e26b32d5861b122efe4"
  },
  "title": "Shazam! Fury of the Gods",
  "description": "The film continues the story of teenage Billy Batson who, upon reciting the magic word \"SHAZAM!\" is transformed into his adult Super Hero alter ego, Shazam.",
  "duration": 131,
  "genre": "Fantasy, Adventure, Action",
  "imageName": "cd21e024-a6bf-4710-93e1-e9ceda2003bc-shazam.jpg"
},{
  "_id": {
    "$oid": "641540d20590bd34b2384a60"
  },
  "title": "John Wick 4",
  "description": "John Wick (Keanu Reeves) discovers a way to defeat the criminal organization The High Table. But before she can win his freedom, Wick must face a new enemy with powerful alliances across the globe, and with forces that turn old friends into adversaries.",
  "duration": 169,
  "genre": "Action, Crime, Suspense",
  "imageName": "71f85824-ef5d-4919-a6b5-5197e08df519-john-wick.png"
},{
  "_id": {
    "$oid": "641541180590bd34b2384a61"
  },
  "title": "Super Mario Bros. The Movie",
  "description": "From Nintendo and Illumination comes a new animated film based on the world of Super Mario Bros. Directed by by Aaron Horvath and Michael Jelenic (collaborators on Teen Titans Go, Teen Titans Go: The Movie) from a screenplay by Matthew Fogel ( LEGO 2's Greatest Adventure, Minions: A Villain Is Born), the film stars Chris Pratt as Mario, Anya Taylor-Joy as Princess Peach, Charlie Day as Luigi, Jack Black as Bowser, Keegan-Michael Key as Toad, Seth Rogen as Donkey Kong, Fred Armisen as Cranky Kong, Kevin Michael Richardson as Kamek, and Sebastian Maniscalco as Spike.",
  "duration": 92,
  "genre": "Action, Comedy",
  "imageName": "dcb2a686-b45a-459a-b554-b3ebc650bbc5-mario.jpg"
},{
  "_id": {
    "$oid": "641541510590bd34b2384a62"
  },
  "title": "Spider-Man: Across the SpiderVerse",
  "description": "Miles Morales returns for the next chapter in the Oscar®-winning Spider-Verse saga, Spider-Man: Across the Spider-Verse. After meeting Gwen Stacy, Spider-Man, Brooklyn's friendly full-time neighbor, is catapulted across the Multiverse, where he meets up with a team of Spider-People charged with protecting his existence. But when the heroes disagree about how to handle a new threat, Miles faces off against the other Spiders and must redefine what it means to be a hero in order to save the people he loves most.",
  "duration": 120,
  "genre": "Animation",
  "imageName": "a550a30c-935f-4410-802c-2905544dece0-spiderman.jpg"
},{
  "_id": {
    "$oid": "641541a10590bd34b2384a63"
  },
  "title": "Flash",
  "description": "Worlds collide in \"The Flash\" when Barry uses his superpowers to travel through time and change the events of the past. Barry attempts to save the family from him, but unknowingly alters the future and is trapped in a reality where General Zod has returned and threatens annihilation, but there are no Super Heroes to turn to. Unless Barry can persuade a very different Batman to come out of retirement and rescue an imprisoned Kryptonian...even if he's not the one he's looking for. Ultimately, to save the world he finds himself in and return to the future he knows, Barry's only hope is to fight to stay alive. But will this latest sacrifice be enough to restart the universe?",
  "duration": 149,
  "genre": "Action, Adventure, Science Fiction, DC Comics, Drama, Fantasy",
  "imageName": "fbd0a468-f898-47c3-b898-62d04e82c8af-flash.jpg"
}]